[Killed] StringLiteral
pgats-ci-lab/src/components/choose-ride.template.js:2:32
 export const templateChooseRide = document.createElement('template');
-templateChooseRide.innerHTML = `
-  <div class="row">
-    <h2 class="col-12 display-4">Choose your ride - prrrt</h2>
-  </div>
-  <div id="rides" class="row">
-  </div>
-  <div class="row">
-    <div class="col-12">&nbsp;</div>
-  </div>
-`;
+templateChooseRide.innerHTML = ``;
 
 export const templateRide = document.createElement('template');
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major v
