[Killed] ConditionalExpression
pgats-ci-lab/src/components/ride.component.js:38:21
     const people = [];
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
-    for (let i = 0; i < this.numPeople; i++) {
+    for (let i = 0; false; i++) {
       people.push({
         index: i + 1,
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major v

[Killed] BlockStatement
pgats-ci-lab/src/components/ride.component.js:38:46
     const people = [];
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
-    for (let i = 0; i < this.numPeople; i++) {
-      people.push({
-        index: i + 1,
-        height: heightInputs[i]?.valueAsNumber ?? 0,
-      });
-    }
+    for (let i = 0; i < this.numPeople; i++) {}
     return people;
   }
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major v

[Killed] ConditionalExpression
pgats-ci-lab/src/components/ride.component.js:73:11
     this.appendChild(cloneTemplate(templateRidePage));
     const rideId = this.getAttribute('ride-id');
     rideService.getRide(rideId).then((ride) => {
-      if (!ride) {
+      if (false) {
         router.navigate([]);
       }
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major

[Survived] StringLiteral
pgats-ci-lab/src/components/ride.component.js:81:38
     });
     this.by.id.peopleSelect.addEventListener('input', this.handleRideSelect);
     this.by.id.previousBtn.addEventListener('click', this.cancel);
-    this.by.id.form.addEventListener('submit', this.submit);
+    this.by.id.form.addEventListener("", this.submit);
     this.#render();
   }

[Killed] EqualityOperator
pgats-ci-lab/src/components/ride.component.js:87:12
 
   /** @param {number} height */
   hasValidHeight(height) {
-    return this.ride.minHeight < height;
+    return this.ride.minHeight >= height;
   }
 
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major

[Killed] ConditionalExpression
pgats-ci-lab/src/components/ride.component.js:98:11
       img.src = this.ride.image;
       img.alt = this.ride.name;
 
-      if (this.ride.minHeight) {
+      if (false) {
         const p = cloneTemplate(minimalRideHeightTemplate);
         new Selector(p).class.minHeight.textContent =
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major

[Survived] StringLiteral
pgats-ci-lab/src/components/ride.component.js:104:45
           this.ride.minHeight.toString();
         this.by.id.heightInputs.replaceChildren(
           p,
-          ...new Array(this.numPeople).fill('').map((_, index) => {
+          ...new Array(this.numPeople).fill("Stryker was here!").map((_, index) => {
             const element = cloneTemplate(heightTemplate);
             const row = new Selector(element);
