[Killed] StringLiteral
pgats-ci-lab/src/components/ride.template.js:46:54
     </div>
   </div>`;
 
-export const heightTemplate = document.createElement('template');
+export const heightTemplate = document.createElement("");
 heightTemplate.innerHTML = `<div class="form-group row">
   <label for="heightInput" class="col-md-4 col-form-label">Height</label>
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major

[Killed] StringLiteral
pgats-ci-lab/src/components/ride.template.js:59:39
   </div>`;
 
 export const minimalRideHeightTemplate = document.createElement('template');
-minimalRideHeightTemplate.innerHTML = `<p class="lead">Minimum height: <span class="min-height"></span> cm</p>`;
+minimalRideHeightTemplate.innerHTML = ``;
 
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.
npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major v
