[Killed] ObjectLiteral
pgats-ci-lab/src/components/robo.component.js:18:7
     this.#element = element;
     this.class = new Proxy(
       {},
-      {
-        get: (_, property) =>
-          this.#element?.querySelector(`.${toKebabCase(String(property))}`),
-      },
+      {},
     );
     this.id = new Proxy(
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major v

[Killed] StringLiteral
pgats-ci-lab/src/components/robo.component.js:20:40
       {},
       {
         get: (_, property) =>
-          this.#element?.querySelector(`.${toKebabCase(String(property))}`),
+          this.#element?.querySelector(``),
       },
     );
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.
npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major ve

[Killed] StringLiteral
pgats-ci-lab/src/components/robo.component.js:27:40
       {},
       {
         get: (_, property) =>
-          this.#element?.querySelector(`#${toKebabCase(String(property))}`),
+          this.#element?.querySelector(``),
       },
     );
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major

[Killed] StringLiteral
pgats-ci-lab/src/components/robo.component.js:35:44
 
 /** @param {string} str */
 function toKebabCase(str) {
-  return str.replace(/([a-z0-9])([A-Z])/g, '$1-$2').toLowerCase();
+  return str.replace(/([a-z0-9])([A-Z])/g, "").toLowerCase();
 }
 
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major
