[Killed] ArrowFunction
pgats-ci-lab/src/pipes/rides-summary.pipe.js:9:52
   let shortDescription = '';
   let people = 'people';
   if (order.ride.minHeight) {
-    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
+    shortDescription = ` (>= ${order.people.reduce(() => undefined).height} cm)`;
   }
   if (order.people.length === 1) {
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major

[Killed] ConditionalExpression
pgats-ci-lab/src/pipes/rides-summary.pipe.js:11:7
   if (order.ride.minHeight) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
   }
-  if (order.people.length === 1) {
+  if (true) {
     people = 'person';
   }
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.
npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major ve
