[Survived] StringLiteral
workspace/pgats-ci-lab/src/router.js:9:35
   /** @param {Pick<globalThis, 'addEventListener'> & { location: { hash: string }}} win */
   constructor(win = window) {
     this.#global = win;
-    this.#global.addEventListener('hashchange', () => {
+    this.#global.addEventListener("", () => {
       this.#routerSubscriptions.forEach((sub) => sub(this.#currentRoute));
     });

[Survived] StringLiteral
workspace/pgats-ci-lab/src/router.js:31:34
     return this.#global.location.hash.substring(1).split('/');
   }
   set #currentRoute(route) {
-    this.#global.location.hash = `#${route.join('/')}`;
+    this.#global.location.hash = ``;
   }
 }
