[Killed] BlockStatement
pgats-ci-lab/src/services/order.service.js:16:75
    * @type {RideOrder}
    */
   get currentOrder() {
-    if (!this.#currentOrder && this.localStorage.getItem('currentOrder')) {
-      this.#currentOrder = JSON.parse(
-        this.localStorage.getItem('currentOrder'),
-      );
-    }
+    if (!this.#currentOrder && this.localStorage.getItem('currentOrder')) {}
     return this.#currentOrder;
   }
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.
npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major ve

[Killed] ConditionalExpression
pgats-ci-lab/src/services/order.service.js:16:9
    * @type {RideOrder}
    */
   get currentOrder() {
-    if (!this.#currentOrder && this.localStorage.getItem('currentOrder')) {
+    if (false) {
       this.#currentOrder = JSON.parse(
         this.localStorage.getItem('currentOrder'),
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.
npm warn Unknown env config "argv". This will stop working in the next major version of npm.
npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.
npm warn Unknown env config "version-git-message". This will stop working in the next major ve

[Survived] StringLiteral
pgats-ci-lab/src/services/order.service.js:28:31
    */
   set currentOrder(value) {
     this.#currentOrder = value;
-    this.localStorage.setItem('currentOrder', JSON.stringify(value));
+    this.localStorage.setItem("", JSON.stringify(value));
   }
 
