[Killed] ArrowFunction
pgats-ci-lab/src/services/ride.service.js:18:23
    */
   async getRide(rideId) {
     const rides = await this.getRides();
-    return rides.find((ride) => ride.id === rideId);
+    return rides.find(() => undefined);
   }
 }
killedBy: All tests
statusReason: npm warn Unknown env config "version-git-tag". This will stop working in the next major version of npm.

npm warn Unknown env config "argv". This will stop working in the next major version of npm.

npm warn Unknown env config "version-commit-hooks". This will stop working in the next major version of npm.

npm warn Unknown env config "version-git-message". This will stop working in the next major
